"{\n  \"subject_name\": \"Programming and Problem Solving in C\",\n  \"course_code\": \"MMC101\",\n  \"modules\": [\n    {\n      \"module_number\": \"Module-1\",\n      \"module_name\": \"BASICS OF C PROGRAMMING\",\n      \"syllabus_content\": \"Introduction to programming paradigms, Applications of C Language, Structure of C program, C programming: Data Types. Constants: Enumeration Constants, Keywords. Operators: Precedence and Associativity, Expressions, Input/output statements. Assignment statements: Decision making statements: Switch statement, Looping statements, Preprocessor directives, Compilation process. Pedagogy : Chalk and talk, Programming exercises, Quiz for assessment.\"\n    },\n    {\n      \"module_number\": \"Module-2\",\n      \"module_name\": \"ARRAYS AND STRINGS\",\n      \"syllabus_content\": \"Arrays: Introduction, One dimensional array: Declaration and Initialization of one dimensional array, Two dimensional arrays: Declaration and Initialization of two dimensional arrays. Sorting: Bubble sort, Selection sort, Searching: Linear search, Binary search. Strings: Definition, Declaration, Initialization of string, String input and output functions, String operations: Length, Concatenation, Copying, Comparison, and Reverse. Pedagogy : Chalk and talk, Programming exercises, Problem Solving Quiz. Technical Talk - 1\"\n    },\n    {\n      \"module_number\": \"Module-3\",\n      \"module_name\": \"FUNCTIONS AND POINTERS\",\n      \"syllabus_content\": \"Functions: Function definition, User-defined Function, Actual parameter and formal parameter, Category of Functions, Local and global variables, function call, Built-in functions (string functions, math functions), Recursion, Binary Search using recursive functions. Pointers: Pointer operators, Pointer arithmetic, Arrays and pointers, Array of pointers, Parameter passing: Pass By value, Pass by reference. Pedagogy : Chalk and talk, Programming exercises, Quiz for assessment.\"\n    },\n    {\n      \"module_number\": \"Module-4\",\n      \"module_name\": \"STRUCTURES AND UNION\",\n      \"syllabus_content\": \"Structures: Nested structures, Pointer and Structures, Array of structures, Self-Referential, structures, Dynamic memory allocation, Singly linked list, typedef. Unions: Storage classes and Visibility. Pedagogy : Chalk and talk, Programming exercises, Quiz for assessment.\"\n    },\n    {\n      \"module_number\": \"Module-5\",\n      \"module"